frontend/controllers/FaqController.php

    protected function findModel($id)
    {
        if (($model = Faq::findOne($id)) !== null) {
---
SELECT * FROM `faq` WHERE `id`='1'