frontend/controllers/FaqRatingController.php

SELECT * FROM `faq_rating` WHERE (`user_id`=2) AND (`faq_id`='1')
---
    public function actionRating() {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }

        $model = new FaqRating();
        $model->user_id = (int) Yii::$app->user->identity->id;

        if ($model->load(Yii::$app->request->post())) {
            $existingRating = FaqRating::find()
                    ->where(['user_id' => $model->user_id])
                    ->andWhere(['faq_id' => $model->faq_id])
                    ->one();

SELECT * FROM `faq` WHERE `id`='1'
---
                ]);
            } else {
                if ($model->save()) {
                    $slug = Faq::find('slug')
                            ->where(['id' => $model->faq_id])
                            ->one();