common/models/ValueHelpers.php

SELECT * FROM `role` WHERE `role_name`='Admin'
---
    public static function isRoleNameValid($role_name) {
        $role = Role::find('role_name')
                ->where(['role_name' => $role_name])
                ->one();