backend/models/Faq.php

    public static function getFaqCateroryList()
    {
        $droptions = FaqCategory::find()->asArray()->all();
---
SELECT * FROM `faq_category` WHERE `id`=1