backend/models/FaqRating.php

SELECT * FROM `faq_rating` WHERE `faq_id`='1'
---
    public function getAverageRating($faq_id)
    {
        $ratings = FaqRating::find('faq_rating')->asArray()
                    ->where(['faq_id' => $faq_id])
                    ->all();