backend/models/MarketingImage.php

    public static function getStatusList()
    {
        $droptions = Status::find()->asArray()->all();
---
SELECT * FROM `status`